# -*- coding: utf-8 -*-
# @Time    : 2024/11/19 21:47
# @Author  : DSTBP
# @File    : config/network_error_codes.py
# @Description : 错误码配置文件

# 错误码定义
ERROR_MESSAGES = {
    # 100: "请求必须为JSON格式",
    101: "无效的JSON格式",
    102: "上传请求缺少必要参数",
    103: "云服务器 ID 重复，超过最大尝试次数，服务器注册失败",
    104: "用户 ID 重复，超过最大尝试次数，用户注册失败",
    105: "网络连接超时",
    106: "服务器响应错误",
    107: "请求过于频繁",
    112: "SM2 解签失败",
    114: "文件已存在，请勿重复上传",
    115: "用户名已存在",
    116: "用户名不存在",
    117: "资源不存在",
    118: "系统内部未知错误",
    119: '文件不存在',
    120: '未指定 file uuid',
    123: "权限不足",
    124: "请求频率超限",
    125: "服务不可用",
    126: '服务器处理签密请求发生未知异常',
    127: '处理下载请求发生未知异常',
    128: '密码错误',
    200: "无错误"
}

# 成功状态码
SUCCESS_CODE = 200

# 标准响应格式
RESPONSE_FORMAT = {
    'data': None,
    'status': 'success',
    'error_code': SUCCESS_CODE
} 